[
    {
        "video": "./demo_videos/LiDOwZESWu4-Scene-0028.mp4",
        "captions": "The video shows a man wearing a red shirt sitting in a black leather chair. He is talking to the camera and appears to be in a living room. In the background, there is a woman walking around the room. The man is looking directly at the camera and appears to be engaged in a conversation or interview. The room is well-lit, and there are various pieces of furniture and decorations visible in the background. The man's facial expressions and body language suggest that he is expressing himself passionately or emphasizing certain points in his discussion."
    },
    {
        "video": "./demo_videos/1plDAxO7NIo-Scene-0022.mp4",
        "captions": "In the video, a man is seen standing next to an orange sports car, touching the tire and then walking around the car. He is wearing a gray shirt and shorts. Another man is standing next to him, wearing a gray shirt and khaki shorts. The car is parked in a parking lot with palm trees in the background. The man who was touching the tire then walks around the car, looking at it from different angles."
    },
    {
        "video": "./demo_videos/DE20mrV1vBQ-Scene-0040.mp4",
        "captions": "In the video, there is a small dog with a fluffy tail and a black and white coat. The dog is seen walking around a yard that is covered in leaves. The yard is enclosed by a colorful fence. The dog appears to be exploring the area, sniffing around and walking in different directions. The sun is shining brightly, and there are some toys scattered around the yard. The dog seems to be enjoying its time outside, and there is a sense of calmness in the video."
    },
    {
        "video": "./demo_videos/K6hGJo9eDqQ-Scene-0167.mp4",
        "captions": "In the video, a man is seen walking down the street while talking to the camera. He is wearing a pink shirt and has a beard. The background shows a building and some posters on the wall. The man seems to be in a good mood and is smiling while speaking. The video is shot in a first-person perspective, giving the viewer a sense of being in the man's shoes. The lighting is dim, suggesting that it is either early morning or late evening. The man's voice is clear and audible, and he appears to be speaking directly to the camera. The video does not show any other people or moving objects, making the man the main focus of the video."
    }
]